Tekla Open API Reference for Tekla Structures 2025
PlacingDirectionAttributes Class
 The PlacingDirectionAttributes class contains the basic attributes for placing directions.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.PlacingDirectionAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class PlacingDirectionAttributes : GenericAttributesBase
<SerializableAttribute>
Public NotInheritable Class PlacingDirectionAttributes
	Inherits GenericAttributesBase
The PlacingDirectionAttributes type exposes the following members.
Constructors
Name | Description
PlacingDirectionAttributes()
 Creates a new placing direction attributes instance. The positive and negative directions are set to false by default.
PlacingDirectionAttributes(Boolean, Boolean)
 Creates a new placing direction attributes instance.
Top
Properties
Name | Description
Negative
 The negative direction of placing.
Positive
 The positive direction of placing.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace